Tekla Open API Reference for Tekla Structures 2025
TeklaStructuresFiles.GetAttributeFile Method (List<String>, String)
 Gets a file info representing the first match in the search directories.
 Namespace: Tekla.Structures
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public FileInfo GetAttributeFile(
	List<string> searchDirectories,
	string fileName
)
Public Function GetAttributeFile (
	searchDirectories As List(Of String),
	fileName As String
) As FileInfo
Parameters
searchDirectories
Type: System.Collections.Generic.List<String>
The list of directories to be used for searching for the file.
fileName
Type: System.String
The name of the file including the file extension.
Return Value
Type: FileInfo
A file info for the first match in the directory list. Null if no match was found.
See Also
Reference
TeklaStructuresFiles Class
GetAttributeFile Overload
Tekla.Structures Namespace